Revit 2024 API
WorksetId.Compare Method
Compares two WorksetIds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int Compare(
	WorksetId id
)
Visual Basic
Public Function Compare ( _
	id As WorksetId _
) As Integer
Visual C++
public:
int Compare(
	WorksetId^ id
)
Parameters
id
Type: Autodesk.Revit.DB.WorksetId
The WorksetId to be compared with this WorksetId.
Return Value
-1 if this WorksetId is less than id, 0 if equal, 1 if greater.
See Also
WorksetId Class
Autodesk.Revit.DB Namespace